reports/M-001/raw/a-ws-vs-poll/m1a-poll500-N1000-r1.k6.txt
time="2026-09-17T00:49:17+09:00" level=warning msg="Insufficient VUs, reached 3000 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=poll


  █ THRESHOLDS 

    poll_ok
    ✗ 'rate>0.99' rate=98.01%


  █ TOTAL RESULTS 

    CUSTOM
    poll_ok.................................................................: 98.01% 319066 out of 325516
    poll_staleness_ms.......................................................: min=14ms   med=552ms    p(95)=991ms    p(99)=1.04s    max=1.33s

    HTTP
    http_req_duration.......................................................: min=2ms    med=531.9ms  p(95)=710.18ms p(99)=824.21ms max=1.34s
      { expected_response:true }............................................: min=3.72ms med=531.94ms p(95)=710.25ms p(99)=824.07ms max=1.34s
    http_req_failed.........................................................: 1.98%  6450 out of 325516
    http_reqs...............................................................: 325516 5373.7182/s

    EXECUTION
    dropped_iterations......................................................: 274485 4531.282764/s
    iteration_duration......................................................: min=2.04ms med=531.7ms  p(95)=709.94ms p(99)=823.99ms max=1.34s
    iterations..............................................................: 325516 5373.7182/s
    vus.....................................................................: 2998   min=1562             max=3000
    vus_max.................................................................: 3000   min=1563             max=3000

    NETWORK
    data_received...........................................................: 181 MB 3.0 MB/s
    data_sent...............................................................: 34 MB  567 kB/s



time="2026-09-17T00:50:16+09:00" level=error msg="thresholds on metrics 'poll_ok' have been crossed"