reports/M-001/raw/a-ws-vs-poll/m1a-poll500-N1000-r2.k6.txt
time="2026-09-17T00:50:43+09:00" level=warning msg="Insufficient VUs, reached 3000 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=poll


  █ THRESHOLDS 

    poll_ok
    ✗ 'rate>0.99' rate=98.02%


  █ TOTAL RESULTS 

    CUSTOM
    poll_ok.................................................................: 98.02% 314136 out of 320479
    poll_staleness_ms.......................................................: min=14ms   med=540ms    p(95)=991ms    p(99)=1.04s    max=1.31s

    HTTP
    http_req_duration.......................................................: min=2.96ms med=541.13ms p(95)=723.13ms p(99)=831.27ms max=1.32s
      { expected_response:true }............................................: min=2.96ms med=541.14ms p(95)=723.17ms p(99)=831.54ms max=1.32s
    http_req_failed.........................................................: 1.97%  6343 out of 320479
    http_reqs...............................................................: 320479 5299.469669/s

    EXECUTION
    dropped_iterations......................................................: 279522 4622.201021/s
    iteration_duration......................................................: min=3ms    med=541.18ms p(95)=723.19ms p(99)=831.34ms max=1.32s
    iterations..............................................................: 320479 5299.469669/s
    vus.....................................................................: 2999   min=1446             max=3000
    vus_max.................................................................: 3000   min=1449             max=3000

    NETWORK
    data_received...........................................................: 178 MB 2.9 MB/s
    data_sent...............................................................: 34 MB  559 kB/s



time="2026-09-17T00:51:41+09:00" level=error msg="thresholds on metrics 'poll_ok' have been crossed"