reports/M-001/raw/a-ws-vs-poll/m1a-poll500-N1000-r3.k6.txt
time="2026-09-17T00:52:08+09:00" level=warning msg="Insufficient VUs, reached 3000 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=poll


  █ THRESHOLDS 

    poll_ok
    ✗ 'rate>0.99' rate=98.01%


  █ TOTAL RESULTS 

    CUSTOM
    poll_ok.................................................................: 98.01% 316340 out of 322746
    poll_staleness_ms.......................................................: min=14ms   med=536ms    p(95)=990ms    p(99)=1.04s    max=1.27s

    HTTP
    http_req_duration.......................................................: min=3.05ms med=534.77ms p(95)=718.19ms p(99)=828.74ms max=1.58s
      { expected_response:true }............................................: min=3.05ms med=534.76ms p(95)=718.2ms  p(99)=828.75ms max=1.58s
    http_req_failed.........................................................: 1.98%  6406 out of 322746
    http_reqs...............................................................: 322746 5324.710391/s

    EXECUTION
    dropped_iterations......................................................: 277255 4574.193265/s
    iteration_duration......................................................: min=3.11ms med=534.83ms p(95)=718.25ms p(99)=828.8ms  max=1.58s
    iterations..............................................................: 322746 5324.710391/s
    vus.....................................................................: 2999   min=1503             max=3000
    vus_max.................................................................: 3000   min=1508             max=3000

    NETWORK
    data_received...........................................................: 179 MB 3.0 MB/s
    data_sent...............................................................: 34 MB  562 kB/s



time="2026-09-17T00:53:06+09:00" level=error msg="thresholds on metrics 'poll_ok' have been crossed"