reports/M-001/raw/a-ws-vs-poll/m1a-poll500-N10000-r1.k6.txt
time="2026-09-17T01:21:59+09:00" level=warning msg="Insufficient VUs, reached 3000 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=poll


  █ THRESHOLDS 

    poll_ok
    ✗ 'rate>0.99' rate=98.01%


  █ TOTAL RESULTS 

    CUSTOM
    poll_ok.................................................................: 98.01%  316508 out of 322913
    poll_staleness_ms.......................................................: min=14ms   med=543ms    p(95)=990ms    p(99)=1.03s    max=1.28s

    HTTP
    http_req_duration.......................................................: min=3.06ms med=535.06ms p(95)=723.67ms p(99)=835ms    max=1.41s
      { expected_response:true }............................................: min=3.06ms med=535.11ms p(95)=723.71ms p(99)=834.94ms max=1.41s
    http_req_failed.........................................................: 1.98%   6405 out of 322913
    http_reqs...............................................................: 322913  5330.677643/s

    EXECUTION
    dropped_iterations......................................................: 5677090 93717.926324/s
    iteration_duration......................................................: min=3.08ms med=535.13ms p(95)=723.72ms p(99)=835.04ms max=1.41s
    iterations..............................................................: 322913  5330.677643/s
    vus.....................................................................: 2993    min=2626             max=3000
    vus_max.................................................................: 3000    min=2630             max=3000

    NETWORK
    data_received...........................................................: 179 MB  3.0 MB/s
    data_sent...............................................................: 34 MB   562 kB/s



time="2026-09-17T01:22:58+09:00" level=error msg="thresholds on metrics 'poll_ok' have been crossed"