reports/M-001/raw/a-ws-vs-poll/m1a-poll500-N10000-r2.k6.txt
time="2026-09-17T01:23:24+09:00" level=warning msg="Insufficient VUs, reached 3000 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=poll


  █ THRESHOLDS 

    poll_ok
    ✗ 'rate>0.99' rate=98.02%


  █ TOTAL RESULTS 

    CUSTOM
    poll_ok.................................................................: 98.02%  316376 out of 322763
    poll_staleness_ms.......................................................: min=14ms   med=545ms    p(95)=989ms    p(99)=1.03s    max=1.32s

    HTTP
    http_req_duration.......................................................: min=2.83ms med=534.15ms p(95)=737.27ms p(99)=855.42ms max=1.45s
      { expected_response:true }............................................: min=2.94ms med=534.18ms p(95)=737.51ms p(99)=855.52ms max=1.45s
    http_req_failed.........................................................: 1.97%   6387 out of 322763
    http_reqs...............................................................: 322763  5336.735082/s

    EXECUTION
    dropped_iterations......................................................: 5677201 93869.860371/s
    iteration_duration......................................................: min=2.87ms med=534.21ms p(95)=737.31ms p(99)=855.48ms max=1.45s
    iterations..............................................................: 322763  5336.735082/s
    vus.....................................................................: 2990    min=2547             max=3000
    vus_max.................................................................: 3000    min=2548             max=3000

    NETWORK
    data_received...........................................................: 179 MB  3.0 MB/s
    data_sent...............................................................: 34 MB   563 kB/s



time="2026-09-17T01:24:23+09:00" level=error msg="thresholds on metrics 'poll_ok' have been crossed"