reports/M-001/raw/a-ws-vs-poll/m1a-poll500-N10000-r3.k6.txt
time="2026-09-17T01:24:49+09:00" level=warning msg="Insufficient VUs, reached 3000 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=poll


  █ THRESHOLDS 

    poll_ok
    ✗ 'rate>0.99' rate=98.01%


  █ TOTAL RESULTS 

    CUSTOM
    poll_ok.................................................................: 98.01%  310687 out of 316970
    poll_staleness_ms.......................................................: min=15ms   med=543ms    p(95)=992ms    p(99)=1.04s    max=1.34s

    HTTP
    http_req_duration.......................................................: min=2.63ms med=548.89ms p(95)=738.47ms p(99)=858.2ms  max=1.46s
      { expected_response:true }............................................: min=2.81ms med=548.93ms p(95)=738.58ms p(99)=858.24ms max=1.46s
    http_req_failed.........................................................: 1.98%   6283 out of 316970
    http_reqs...............................................................: 316970  5231.213549/s

    EXECUTION
    dropped_iterations......................................................: 5683035 93791.745879/s
    iteration_duration......................................................: min=2.67ms med=548.95ms p(95)=738.54ms p(99)=858.24ms max=1.46s
    iterations..............................................................: 316970  5231.213549/s
    vus.....................................................................: 3000    min=2548             max=3000
    vus_max.................................................................: 3000    min=2548             max=3000

    NETWORK
    data_received...........................................................: 176 MB  2.9 MB/s
    data_sent...............................................................: 33 MB   552 kB/s



time="2026-09-17T01:25:49+09:00" level=error msg="thresholds on metrics 'poll_ok' have been crossed"