reports/M-001/raw/a-ws-vs-poll/m1a-poll500-N5000-r1.k6.txt
time="2026-09-17T01:04:20+09:00" level=warning msg="Insufficient VUs, reached 3000 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=poll


  █ THRESHOLDS 

    poll_ok
    ✗ 'rate>0.99' rate=98.01%


  █ TOTAL RESULTS 

    CUSTOM
    poll_ok.................................................................: 98.01%  319825 out of 326289
    poll_staleness_ms.......................................................: min=15ms   med=554ms    p(95)=988ms    p(99)=1.04s    max=1.33s

    HTTP
    http_req_duration.......................................................: min=2.36ms med=527.76ms p(95)=737.31ms p(99)=888.64ms max=1.44s
      { expected_response:true }............................................: min=2.51ms med=527.77ms p(95)=737.05ms p(99)=888.43ms max=1.44s
    http_req_failed.........................................................: 1.98%   6464 out of 326289
    http_reqs...............................................................: 326289  5384.486947/s

    EXECUTION
    dropped_iterations......................................................: 2673726 44122.366203/s
    iteration_duration......................................................: min=2.4ms  med=527.82ms p(95)=737.34ms p(99)=888.71ms max=1.44s
    iterations..............................................................: 326289  5384.486947/s
    vus.....................................................................: 3000    min=2602             max=3000
    vus_max.................................................................: 3000    min=2603             max=3000

    NETWORK
    data_received...........................................................: 181 MB  3.0 MB/s
    data_sent...............................................................: 34 MB   568 kB/s



time="2026-09-17T01:05:20+09:00" level=error msg="thresholds on metrics 'poll_ok' have been crossed"