reports/M-001/raw/a-ws-vs-poll/m1a-poll500-N5000-r3.k6.txt
time="2026-09-17T01:07:11+09:00" level=warning msg="Insufficient VUs, reached 3000 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=poll


  █ THRESHOLDS 

    poll_ok
    ✗ 'rate>0.99' rate=98.01%


  █ TOTAL RESULTS 

    CUSTOM
    poll_ok.................................................................: 98.01%  319431 out of 325896
    poll_staleness_ms.......................................................: min=15ms   med=559ms    p(95)=989ms    p(99)=1.04s    max=1.33s

    HTTP
    http_req_duration.......................................................: min=1.98ms med=527.82ms p(95)=729.42ms p(99)=908.05ms max=1.4s 
      { expected_response:true }............................................: min=2.62ms med=527.83ms p(95)=729.39ms p(99)=908.21ms max=1.4s 
    http_req_failed.........................................................: 1.98%   6465 out of 325896
    http_reqs...............................................................: 325896  5386.881788/s

    EXECUTION
    dropped_iterations......................................................: 2674105 44201.486133/s
    iteration_duration......................................................: min=2.01ms med=527.88ms p(95)=729.48ms p(99)=908.07ms max=1.4s 
    iterations..............................................................: 325896  5386.881788/s
    vus.....................................................................: 2999    min=2423             max=3000
    vus_max.................................................................: 3000    min=2425             max=3000

    NETWORK
    data_received...........................................................: 181 MB  3.0 MB/s
    data_sent...............................................................: 34 MB   568 kB/s



time="2026-09-17T01:08:10+09:00" level=error msg="thresholds on metrics 'poll_ok' have been crossed"